["Hi again", "Professor Theodore Moustakas was elected a Fellow Member of the Optical Society. Click here to read more - https://t.co/faMyNhKffA", "The Dept. of Electrical Engineering at Princeton University is seeking applications for a tenure-track assistant pr… https://t.co/aM8PitacKh", "The OpenStack Foundation is holding its annual Open Infrastructure Summit. BU's Michael Daitzman, Director of Engin… https://t.co/t2UXdPjIkM", "RT @BU_IHSIP: ICYMI: @BU_ece’s Lifu Zhang discussed his summer research alongside faculty advisor Honghuang Lin – refining #deeplearning al…", "Professor Rabia Yazicigil spoke on the Women in Engineering Panel at the IEEE Virtual World Forum on Internet of Th… https://t.co/OY41mYPAEU", "Hi", "University of Maryland, Baltimore County is accepting applications for a two-year Postdoctoral Fellow for Faculty D… https://t.co/JXYaj5jiK7", "RT @ProfArmani: I can't wait any longer to announce the amazing faculty who are volunteering their time to join panels for this #mentoring…", "PhD Students and Postdocs: A virtual session, “Launching Your Career in the Med Tech Industry,” will be held on \nTu… https://t.co/K3Y5OTt7Iy", "Professors Douglas Densmore and Rabia Yazicigil were awarded a $1.5M grant by the National Science Foundation for a… https://t.co/sFd7NFjMgJ", "ECE Alumna Allie Mellen spoke to @Marketplace  about security recommendations for college students doing virtual le… https://t.co/Tl3W7sBEfk", "Prof. Luca Dal Negro received a @NSF Award for a project that will be developing miniaturized optical devices to si… https://t.co/qrAWGhx4Dy", "Correlation One is an NYC-based startup that hosts data science and engineering competitions for the world’s best S… https://t.co/0vkEGYJaVg", "https://t.co/TJlY20YskD", "Prof. Alan Pisano is looking for great project ideas for the capstone Senior Design Course at Boston University sta… https://t.co/xEY8lv8EtZ", "The Dissertation Writing Institute is designed to help doctoral candidates accomplish their writing goals and make… https://t.co/bLqGkTObiB", "ECE graduate student Santiago Gomez took action against the use of “master/slave” terminology in his engineering te… https://t.co/6Ki5mXBwO9", "The IEEE Information Theory Society has honored BU ECE Research Professor Robert M. Gray with the 2020 Aaron D. Wyn… https://t.co/TojTehWppN", "Prepare for liftoff! Checkout @BURPG's Summer 2020 Newsletter using this link:  https://t.co/fq3gxi4wEK"]